In [16]:
import pandas as pd
from datetime import datetime as dt

In [17]:
df = pd.read_csv('hawaii_measurements.csv')
df.head()

       station        date  prcp  tobs
0  USC00519397  2010-01-01  0.08    65
1  USC00519397  2010-01-02  0.00    63
2  USC00519397  2010-01-03  0.00    74
3  USC00519397  2010-01-04  0.00    76
4  USC00519397  2010-01-06   NaN    73

In [20]:
# Convert the date column format from string to datetime
#df['date'] = pd.to_datetime(df['date'], format='%Y-%m-*-%d')
date_df = df['date'].apply(pd.to_datetime)
date_df

0       2010-01-01
1       2010-01-02
2       2010-01-03
3       2010-01-04
4       2010-01-06
           ...
19545   2017-08-19
19546   2017-08-20
19547   2017-08-21
19548   2017-08-22
19549   2017-08-23
Name: date, Length: 19550, dtype: datetime64[ns]

In [ ]:
#datafrm = pd.DataFrame(list(retri_data) ,columns = ['date']) 
#datafrm

In [21]:
dff = pd.DataFrame(list(date_df) ,columns = ['date']) 
dff

            date
0     2010-01-01
1     2010-01-02
2     2010-01-03
3     2010-01-04
4     2010-01-06
...          ...
19545 2017-08-19
19546 2017-08-20
19547 2017-08-21
19548 2017-08-22
19549 2017-08-23

[19550 rows x 1 columns]

In [23]:

set_index_df = df.set_index('date')
set_index_df

                station  prcp  tobs
date
2010-01-01  USC00519397  0.08    65
2010-01-02  USC00519397  0.00    63
2010-01-03  USC00519397  0.00    74
2010-01-04  USC00519397  0.00    76
2010-01-06  USC00519397   NaN    73
...                 ...   ...   ...
2017-08-19  USC00516128  0.09    71
2017-08-20  USC00516128   NaN    78
2017-08-21  USC00516128  0.56    76
2017-08-22  USC00516128  0.50    76
2017-08-23  USC00516128  0.45    76

[19550 rows x 3 columns]

In [24]:
df_index = df.reset_index(drop=True)
df_index

           station        date  prcp  tobs
0      USC00519397  2010-01-01  0.08    65
1      USC00519397  2010-01-02  0.00    63
2      USC00519397  2010-01-03  0.00    74
3      USC00519397  2010-01-04  0.00    76
4      USC00519397  2010-01-06   NaN    73
...            ...         ...   ...   ...
19545  USC00516128  2017-08-19  0.09    71
19546  USC00516128  2017-08-20   NaN    78
19547  USC00516128  2017-08-21  0.56    76
19548  USC00516128  2017-08-22  0.50    76
19549  USC00516128  2017-08-23  0.45    76

[19550 rows x 4 columns]

In [26]:
from scipy import stats
from numpy import mean

In [29]:
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy import Column, String, Float, Integer
from sqlalchemy import create_engine
from sqlalchemy.orm import Session

In [30]:
Base = declarative_base()
database_path = "../Resources/hawaii.sqlite"
engine = create_engine(f"sqlite:///{database_path}")
Base.metadata.create_all(engine)

In [31]:
session = Session(bind=engine)
session

In [39]:
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func
from sqlalchemy import create_engine, inspect 
from sqlalchemy import Column, Integer, String, Float

In [40]:
inspector = inspect(engine)

In [42]:
Base = automap_base()

In [43]:
Base.prepare(engine, reflect=True)

In [44]:
Base.classes.keys()

['measurement', 'station']

In [46]:
Measurement = Base.classes.measurement
Station = Base.classes.station

In [57]:
month_query = session.query(Measurement).\
    filter( Measurement.date == '2010-01-01')
 #   filter(Measurement.date == '2017-08-23').count()

In [58]:
month_query